tools/fio_rw_2025-12-17_082838.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1823745: Wed Dec 17 08:28:40 2025
  read: IOPS=91.1k, BW=356MiB/s (373MB/s)(512MiB/1439msec)
    slat (nsec): min=683, max=70385, avg=2302.53, stdev=1932.84
    clat (nsec): min=277, max=3523.7k, avg=134068.69, stdev=140010.47
     lat (nsec): min=1007, max=3525.4k, avg=136371.22, stdev=140327.51
    clat percentiles (nsec):
     |  1.00th=[    302],  5.00th=[    342], 10.00th=[   2704],
     | 20.00th=[   6944], 30.00th=[  13248], 40.00th=[  72192],
     | 50.00th=[ 109056], 60.00th=[ 142336], 70.00th=[ 193536],
     | 80.00th=[ 252928], 90.00th=[ 321536], 95.00th=[ 378880],
     | 99.00th=[ 501760], 99.50th=[ 552960], 99.90th=[ 708608],
     | 99.95th=[ 847872], 99.99th=[2965504]
   bw (  KiB/s): min=358832, max=366016, per=99.50%, avg=362424.00, stdev=5079.86, samples=2
   iops        : min=89708, max=91504, avg=90606.00, stdev=1269.96, samples=2
  write: IOPS=91.1k, BW=356MiB/s (373MB/s)(512MiB/1439msec); 0 zone resets
    slat (nsec): min=1444, max=59738, avg=3098.63, stdev=2230.30
    clat (usec): min=12, max=2890, avg=35.25, stdev=39.38
     lat (usec): min=17, max=2892, avg=38.35, stdev=39.56
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   25], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   33], 60.00th=[   35],
     | 70.00th=[   37], 80.00th=[   40], 90.00th=[   46], 95.00th=[   54],
     | 99.00th=[   89], 99.50th=[   99], 99.90th=[  118], 99.95th=[  128],
     | 99.99th=[ 2769]
   bw (  KiB/s): min=358904, max=363848, per=99.16%, avg=361376.00, stdev=3495.94, samples=2
   iops        : min=89726, max=90962, avg=90344.00, stdev=873.98, samples=2
  lat (nsec)   : 500=3.50%, 750=0.05%, 1000=0.01%
  lat (usec)   : 2=0.45%, 4=2.74%, 10=6.12%, 20=5.51%, 50=47.91%
  lat (usec)   : 100=7.38%, 250=16.17%, 500=9.65%, 750=0.47%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=14.81%, sys=49.17%, ctx=84923, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=356MiB/s (373MB/s), 356MiB/s-356MiB/s (373MB/s-373MB/s), io=512MiB (537MB), run=1439-1439msec
  WRITE: bw=356MiB/s (373MB/s), 356MiB/s-356MiB/s (373MB/s-373MB/s), io=512MiB (537MB), run=1439-1439msec

Disk stats (read/write):
  nvme0n1: ios=77056/127547, sectors=616448/1020376, merge=0/0, ticks=15785/2598, in_queue=18383, util=62.82%