tools/fio_rw_2025-12-17_084546.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1842123: Wed Dec 17 08:45:47 2025
  read: IOPS=92.0k, BW=359MiB/s (377MB/s)(512MiB/1424msec)
    slat (nsec): min=681, max=33434, avg=2273.13, stdev=1849.31
    clat (nsec): min=284, max=3561.9k, avg=133119.83, stdev=140430.28
     lat (nsec): min=1028, max=3563.5k, avg=135392.96, stdev=140740.18
    clat percentiles (nsec):
     |  1.00th=[    302],  5.00th=[    334], 10.00th=[   2640],
     | 20.00th=[   6752], 30.00th=[  12864], 40.00th=[  71168],
     | 50.00th=[ 107008], 60.00th=[ 142336], 70.00th=[ 193536],
     | 80.00th=[ 250880], 90.00th=[ 317440], 95.00th=[ 374784],
     | 99.00th=[ 497664], 99.50th=[ 552960], 99.90th=[ 675840],
     | 99.95th=[ 839680], 99.99th=[3031040]
   bw (  KiB/s): min=370912, max=371336, per=100.00%, avg=371124.00, stdev=299.81, samples=2
   iops        : min=92728, max=92834, avg=92781.00, stdev=74.95, samples=2
  write: IOPS=92.1k, BW=360MiB/s (377MB/s)(512MiB/1424msec); 0 zone resets
    slat (nsec): min=1383, max=63226, avg=3022.62, stdev=2116.39
    clat (usec): min=12, max=2941, avg=34.39, stdev=46.66
     lat (usec): min=17, max=2943, avg=37.41, stdev=46.71
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   24], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   33], 60.00th=[   35],
     | 70.00th=[   37], 80.00th=[   40], 90.00th=[   44], 95.00th=[   49],
     | 99.00th=[   64], 99.50th=[   72], 99.90th=[   98], 99.95th=[  116],
     | 99.99th=[ 2868]
   bw (  KiB/s): min=368712, max=371376, per=100.00%, avg=370044.00, stdev=1883.73, samples=2
   iops        : min=92178, max=92844, avg=92511.00, stdev=470.93, samples=2
  lat (nsec)   : 500=3.64%, 750=0.03%, 1000=0.01%
  lat (usec)   : 2=0.44%, 4=2.80%, 10=6.15%, 20=5.70%, 50=48.73%
  lat (usec)   : 100=6.46%, 250=15.92%, 500=9.61%, 750=0.45%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%
  cpu          : usr=15.11%, sys=48.42%, ctx=85220, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=359MiB/s (377MB/s), 359MiB/s-359MiB/s (377MB/s-377MB/s), io=512MiB (537MB), run=1424-1424msec
  WRITE: bw=360MiB/s (377MB/s), 360MiB/s-360MiB/s (377MB/s-377MB/s), io=512MiB (537MB), run=1424-1424msec

Disk stats (read/write):
  nvme0n1: ios=77916/128924, sectors=623328/1031392, merge=0/0, ticks=15983/2650, in_queue=18634, util=63.08%