tools/fio_rw_2025-12-17_090502.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1848158: Wed Dec 17 09:05:04 2025
  read: IOPS=91.4k, BW=357MiB/s (374MB/s)(512MiB/1434msec)
    slat (nsec): min=701, max=28927, avg=2236.21, stdev=1779.80
    clat (nsec): min=283, max=3566.9k, avg=135298.70, stdev=144020.35
     lat (nsec): min=1046, max=3568.6k, avg=137534.92, stdev=144310.26
    clat percentiles (nsec):
     |  1.00th=[    302],  5.00th=[    326], 10.00th=[   2544],
     | 20.00th=[   6368], 30.00th=[  12096], 40.00th=[  71168],
     | 50.00th=[ 109056], 60.00th=[ 144384], 70.00th=[ 197632],
     | 80.00th=[ 254976], 90.00th=[ 321536], 95.00th=[ 382976],
     | 99.00th=[ 509952], 99.50th=[ 569344], 99.90th=[ 733184],
     | 99.95th=[1204224], 99.99th=[3096576]
   bw (  KiB/s): min=361520, max=369824, per=100.00%, avg=365672.00, stdev=5871.81, samples=2
   iops        : min=90380, max=92456, avg=91418.00, stdev=1467.95, samples=2
  write: IOPS=91.4k, BW=357MiB/s (374MB/s)(512MiB/1434msec); 0 zone resets
    slat (nsec): min=1459, max=64270, avg=3015.79, stdev=2054.89
    clat (usec): min=11, max=3098, avg=33.56, stdev=36.95
     lat (usec): min=17, max=3099, avg=36.58, stdev=37.02
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   22], 10.00th=[   24], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   32], 60.00th=[   35],
     | 70.00th=[   37], 80.00th=[   39], 90.00th=[   43], 95.00th=[   48],
     | 99.00th=[   61], 99.50th=[   68], 99.90th=[   84], 99.95th=[  113],
     | 99.99th=[ 2868]
   bw (  KiB/s): min=361480, max=367808, per=99.71%, avg=364644.00, stdev=4474.57, samples=2
   iops        : min=90370, max=91952, avg=91161.00, stdev=1118.64, samples=2
  lat (nsec)   : 500=3.79%, 750=0.05%, 1000=0.01%
  lat (usec)   : 2=0.47%, 4=2.87%, 10=6.30%, 20=5.57%, 50=49.00%
  lat (usec)   : 100=5.71%, 250=15.76%, 500=9.87%, 750=0.54%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.02%
  cpu          : usr=13.40%, sys=49.48%, ctx=85394, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=357MiB/s (374MB/s), 357MiB/s-357MiB/s (374MB/s-374MB/s), io=512MiB (537MB), run=1434-1434msec
  WRITE: bw=357MiB/s (374MB/s), 357MiB/s-357MiB/s (374MB/s-374MB/s), io=512MiB (537MB), run=1434-1434msec

Disk stats (read/write):
  nvme0n1: ios=77379/128102, sectors=619032/1024824, merge=0/1, ticks=16197/2593, in_queue=18790, util=62.42%